def words(numb):
    num={1:"ຫນຶ່ງ",2:"ສອງ",3:"ສາມ",4:"ສີ່",5:"ຫ້າ",6:"ຫົກ",7:"ເຈັດ",8:"ແປດ",9:"ເກົ້າ",10:"ສິບ",
            11:"ສິບເອັດ",20:"ຊາວ",21:"ຊາວເອັດ",30:"ສາມສິບ",31:"ສາມສິບເອັດ",40:"ສີ່ສິບ",41:"ສີ່ສິບເອັດ",
            50:"ຫ້າສິບ",51:"ຫ້າສິບເອັດ",60:"ຫົກສິບ",61:"ຫົກສິບເອັດ",70:"ເຈັດສິບ",71:"ເຈັດສິບເອັດ",
            80:"ແປດສິບ",81:"ແປດສິບເອັດ",90:"ເກົ້າສິບ",91:"ເກົ້າສິບເອັດ",}
    if numb<=99:
        if numb in num:
            lao = num.get(numb)
            print( numb ,"ຄຳອ່ານພາສາລາວແມ່ນ: ", lao)
        else:
            x = numb%10
            x = num.get(x)
            c = numb//10
            c = c*10
            c = num.get(c) 
            lao=c+x
            print(numb,"ຄຳອ່ານພາສາລາວແມ່ນ: ",lao)
    else:
        print("!!!!! ບອກໃຫ້ປ້ອນ 1 ຫາ 99 !!!!!")
numip = int(input("ປ້ອນຕົວເລກທີ່ຕ້ອງການແປເປັນ ພາສາລາວ ລະຫວ່າງ 1 ຫາ 99 : "))
words(numip)